{
  "title": "Duality is not the answer",
  "excerpt": "",
  "content": "Winters in Bangalore have never been this harsh, cold winds in early morning and late nights are almost unbearable. Sour throat, fever have been like the visiting guests here, coming every week after the other. The night is quiet when you live in a high rise society. The noise of the outside can't affect you much and almost every sound from outside comes with a less amplitude.\n\nWe are adapted to duality throughout our lives. We have accepted this as a way of living. Duality is present in almost everything , cold and hot, summers and winters, good and bad, right and wrong, happy and sad and so on. This duality is responsible for most of our problems however we are not aware of it. It blocks the understanding of the current emotion because we are so used to running towards another end. The moments we find out we are angry, we move towards non-anger, the moment we realise we are pursuing violence we go towards non-violence because society has taught us the good and bad. On a superficial layer it looks good as society has set some standards for morality but internally it breeds frustration and anger. The anger that piles up inside takes its form in another way either it comes out on oneself or on the servant or on the government. Any pursuit of this duality blocks the energy to flow in one's mind. This is not something I have read or followed but from direct observation and experimentation has been derived. When one lives totally in the present and does not run away in the name of goodness etc. which is nothing but accepted conditioning of the society, one will find that his anger dissolves like salt in the water. It is not something forced but rather the mind gets some form of energy naturally supplied from an unknown source to its mind. It is very important to understand this otherwise from outwardly we may act like we are non-violent, calm, good etc but internally we lack the overall understanding which gives rise to anger and frustration\n\n",
  "published": true,
  "slug": "duality-is-not-the-answer",
  "date": "2025-12-17"
}