{
  "title": "Pleasure and Happiness",
  "excerpt": "The writings here are derived from writer's own personal experiences",
  "content": "The office has multiple things with different colours including a wooden desk, silver monitors, green cubicles, white lights, black laptops, blue shoes and many more things. The Breakfast also presented a lot of variety including Idli, snacks, fruits, juice etc. There are things here that are generally not available to the general public and yet one is never satisfied with anything as there is inevitable boredom which is waiting for you after its consumption. I read something today where the Great Ramana Maharshi said that the person who doesn't want anything is better than an emperor. I sometimes feel that. Being born in a middle class childhood, the amenities that I have today are something I couldn't have imagined in a thousand year and yet the core happiness does not depend on this. There is great sorrow that awaits one when the things of the mind loses its cravings. I wonder if people are aware about this thing at all. Due to lack of awareness of this understanding the night clubs, drugs, sex becomes all important as they provide a great escape from the current sorrow. This great escape is called pleasure for which man from time immemorial has done all kinds of cruelty in this world. Even after this understanding, since he cant do anything about this sorrow, pleasure is pursued again and again and that makes the mind dull. \n\nBut when one sees all of this, he asks what is happiness then. As I sit here in the office with almost all kind of facilities I crave to become something. I am dependent on the images in my head to satisfy them, please them and derive psychological security from it. I see all the drama that unfolds where a person becomes a slave to lust, which ultimately gives birth to anger which causes restlessness and pushes the joy of life away. \n\nCan the mind ever live in the present? Without any care for the past and future, giving equal detachment to pain and pleasure. I have observed this thing sometimes but I keep becoming a victim to pleasure again and again causing happiness to hide in the shady areas of life. \n\nWriting and expressing your thoughts like this provides a really good way to be aware of your own self. I will keep writing things and hopefully this blog will find its way through the waves of time.\n\nThanks Everyone for your time!",
  "published": true,
  "slug": "pleasure-and-happiness",
  "date": "2025-10-03"
}