{
  "title": "The Mind",
  "excerpt": "Cessna tech park, Bangalore. 12th Dec 25, 2:25PM",
  "content": "The mind is a very tricky thing. It constantly needs some entertainment to keep itself busy. It has an electrical component which is thought. Thought gives us a great sense of energy and in return came back us with the same energy and provides us pain. All our life is spent on constantly battling the opposites of this energy. Psychologists. doctors, religious teachers have said to control thought, distract your mind, do some breathing exercises but all have deluded oneself. The mind becomes dull day by day by this constant imposed agitation. The pressures of society is one thing but the pressures and authority created by the images that the mind carries is a different thing. We all go under this pain day by day. To avoid this pain, to find some happiness we pursue entertainment, love, respect, power etc. \n\nThe office is a talkative place. People are sitting on their chairs with monitors in front. Lunch is currently ongoing, people have started to line up to get their meal. Even though you can hear voices of people coming from every place, one's mind is in meditation. There is a great silence which absorbs all the outside and inside chatter. This silence comes without any effort but through attention. Attention is never forced, if it is it becomes another play of the mind. So effort has no role in meditation. The breath is affected by the mind, when one is in stress, confusion, fear it becomes heavy. When one is relaxed without any wants it becomes slow and the mind recharges itself. But this does not mean one should control breath otherwise it causes confusion and again effort comes into play. In attention, one is aware of all the outward things like sound of the keyboard, people chattering in meetings, sound of moving wheels of the chair, lights getting on/off and the inward things like heaviness in shoulders, cooling relaxation in brain, energy flowing in the legs, the expansion of lungs, stomach. \n\nIt has been a habit of us to keep ourselves busy with some tasks, some ambition or any gossip because there is this emptiness we all want to avoid. Keeping ourselves busy we move away from this emptiness and it obviously keeps the confusion away. But when one is in attention, there is no boredom, there is no requirement of any dopamine spikes as one feels complete on his own. There is no control of breath, thoughts, no suppression of fear or desire, there is no controller so no attachment is there. The images in the mind come and go without any force. As the mind moves away from the regular thoughts it has entertained for god knows how many years, it finds solace in himself. It is a beautiful thing to observe. \n\n",
  "published": true,
  "slug": "the-mind",
  "date": "2025-12-12"
}